# La clase DataFrame

Un `DataFrame` es una agrupación de `Series` unidas bajo los mismos índices dando como resultado estructuras similares a tablas donde representar todo tipo de información.

Cada serie del `DataFrame` se puede considerar una columna a la cuál podemos establecer un nombre:

In [1]:
import pandas as pd
import numpy as np

array = np.random.randint(-10, 10, size=[4,4])

df = pd.DataFrame(array, index=['A','B','C','D'], columns=['W','X','Y','Z'])

In [2]:
# Representación en jupyter
df

   W  X  Y   Z
A -6 -3 -4   6
B -6  6 -3 -10
C -5  2  3   0
D -7 -8  2  -3

In [3]:
# Representación por pantalla
print(df)

   W  X  Y   Z
A -6 -3 -4   6
B -6  6 -3 -10
C -5  2  3   0
D -7 -8  2  -3

In [4]:
# Tipo de un df
type(df)

pandas.core.frame.DataFrame

## Trabajando con DataFrames

Podemos consultar una columna mediante su nombre:

In [5]:
df['X']

A   -3
B    6
C    2
D   -8
Name: X, dtype: int32

Como vemos una columna es en realidad una serie:

In [6]:
type(df['X'])

pandas.core.series.Series

También podemos consultar varias columnas pasando una lista con los nombres:

In [7]:
df[['Y','Z']]

   Y   Z
A -4   6
B -3 -10
C  3   0
D  2  -3

### Añadir una columna

In [8]:
df['TOTAL'] = df['W'] + df['X'] + df['Y'] + df['Z']

In [9]:
df

   W  X  Y   Z  TOTAL
A -6 -3 -4   6     -7
B -6  6 -3 -10    -13
C -5  2  3   0      0
D -7 -8  2  -3    -16

### Borrar una columna

In [10]:
df.drop('TOTAL', axis=1)

   W  X  Y   Z
A -6 -3 -4   6
B -6  6 -3 -10
C -5  2  3   0
D -7 -8  2  -3

In [12]:
# No se modifica el df original
df

   W  X  Y   Z  TOTAL
A -6 -3 -4   6     -7
B -6  6 -3 -10    -13
C -5  2  3   0      0
D -7 -8  2  -3    -16

In [13]:
# A no ser que le indiquemos explícitamente
df.drop('TOTAL', axis=1, inplace=True)

df

   W  X  Y   Z
A -6 -3 -4   6
B -6  6 -3 -10
C -5  2  3   0
D -7 -8  2  -3

### Borrar una fila

In [14]:
df.drop('D', axis=0)

   W  X  Y   Z
A -6 -3 -4   6
B -6  6 -3 -10
C -5  2  3   0

### Seleccionar filas

In [15]:
df.loc['C']

W   -5
X    2
Y    3
Z    0
Name: C, dtype: int32

También podemos utilizar el índice:

In [16]:
df.iloc[2]

W   -5
X    2
Y    3
Z    0
Name: C, dtype: int32

### Seleccionar subset

In [17]:
# Fila C y columna Z 
df.loc['C','Z']

0

In [18]:
# Filas A,B y columnas W,Y
df.loc[['A','B'],['W','Y']]

   W  Y
A -6 -4
B -6 -3

## Selección condicionada

Una de las mayores utilidades de los `DataFrames` es su capacidad para realizar consultas condicionadas:

In [19]:
df

   W  X  Y   Z
A -6 -3 -4   6
B -6  6 -3 -10
C -5  2  3   0
D -7 -8  2  -3

In [20]:
# Registros >0
df>0

       W      X      Y      Z
A  False  False  False   True
B  False   True  False  False
C  False   True   True  False
D  False  False   True  False

In [21]:
# Valor de los registros >0
df[df>0]

    W    X    Y    Z
A NaN  NaN  NaN  6.0
B NaN  6.0  NaN  NaN
C NaN  2.0  3.0  NaN
D NaN  NaN  2.0  NaN

In [22]:
# Valor de los registros cuando X>0
df[df['X']>0]

   W  X  Y   Z
B -6  6 -3 -10
C -5  2  3   0

In [23]:
# Valor de los registros en las columnas Y,Z si X>0
df[df['X']>0][['Y','Z']]

   Y   Z
B -3 -10
C  3   0

Podemos unir condiciones usando los operadores `or` con `|` y `and` con `&`:

In [24]:
# Valor de los registros cuando X>0 o Z<0
df[(df['X']>0) | (df['Z'] < 0)]

   W  X  Y   Z
B -6  6 -3 -10
C -5  2  3   0
D -7 -8  2  -3

In [25]:
# Valor de los registros en las columnas W e Y cuando X>0 o Z<0
df[(df['X']>0) | (df['Z'] < 0)][['W','Y']]

   W  Y
B -6 -3
C -5  3
D -7  2

## Modificar índices

In [26]:
# Creamos de nuevo el dataframe
array = np.random.uniform(-10, 10, size=[4,4])
df = pd.DataFrame(array, index=['A','B','C','D'], columns=['W','X','Y','Z'])
df

          W         X         Y         Z
A -8.634698 -8.909431  3.079274 -0.747587
B  0.337110 -5.090491 -4.417163  4.756681
C -5.842196 -6.070270  9.111175 -2.549655
D -1.411719  7.709184 -4.981271 -0.642108

In [27]:
# Añadimos una nueva Serie con el nombre de los índices
df['Códigos'] = ['AA','BB','CC','DD']

df

          W         X         Y         Z Códigos
A -8.634698 -8.909431  3.079274 -0.747587      AA
B  0.337110 -5.090491 -4.417163  4.756681      BB
C -5.842196 -6.070270  9.111175 -2.549655      CC
D -1.411719  7.709184 -4.981271 -0.642108      DD

In [28]:
# Substituimos los índices de las filas
df.set_index('Códigos')

                W         X         Y         Z
Códigos
AA      -8.634698 -8.909431  3.079274 -0.747587
BB       0.337110 -5.090491 -4.417163  4.756681
CC      -5.842196 -6.070270  9.111175 -2.549655
DD      -1.411719  7.709184 -4.981271 -0.642108

In [29]:
# No se guardan por defecto
df

          W         X         Y         Z Códigos
A -8.634698 -8.909431  3.079274 -0.747587      AA
B  0.337110 -5.090491 -4.417163  4.756681      BB
C -5.842196 -6.070270  9.111175 -2.549655      CC
D -1.411719  7.709184 -4.981271 -0.642108      DD

In [30]:
# A no ser que lo especifiquemos explícitamente
df.set_index('Códigos', inplace=True)

df

                W         X         Y         Z
Códigos
AA      -8.634698 -8.909431  3.079274 -0.747587
BB       0.337110 -5.090491 -4.417163  4.756681
CC      -5.842196 -6.070270  9.111175 -2.549655
DD      -1.411719  7.709184 -4.981271 -0.642108

In [31]:
print(df)

                W         X         Y         Z
Códigos
AA      -8.634698 -8.909431  3.079274 -0.747587
BB       0.337110 -5.090491 -4.417163  4.756681
CC      -5.842196 -6.070270  9.111175 -2.549655
DD      -1.411719  7.709184 -4.981271 -0.642108

In [ ]:
# consultamos una fila con el nuevo índice
df.loc['AA']

### Índices por defecto

In [32]:
# Reiniciamos los índices y borramos los anteriores explícitamente
df.reset_index(drop=True, inplace=True)

df

          W         X         Y         Z
0 -8.634698 -8.909431  3.079274 -0.747587
1  0.337110 -5.090491 -4.417163  4.756681
2 -5.842196 -6.070270  9.111175 -2.549655
3 -1.411719  7.709184 -4.981271 -0.642108

Esto es solo la punta del iceberg, para más información sobre la clase `DataFrame` tenéis la [documentación oficial](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html).